# A) Label Based Indexing

loc function is an important function that can be used for indexing, for extracting row use df.loc[" "] and for column use df.loc[:," "]

In [2]:
import pandas as pd
ResultSheet = {"Arnab":pd.Series([90,91,97],index=["Maths","Science","Hindi"]),
              "Riya":pd.Series([100,95,78],index=["Maths","Science","Hindi"]),
              "Ishita":pd.Series([47,100,98],index=["Maths","Science","Hindi"]),
              "Samridhi":pd.Series([97,52,100],index=["Maths","Science","Hindi"]),
              "Rohan":pd.Series([89,82,77],index=["Maths","Science","Hindi"])}
df=pd.DataFrame(ResultSheet)
df

         Arnab  Riya  Ishita  Samridhi  Rohan
Maths       90   100      47        97     89
Science     91    95     100        52     82
Hindi       97    78      98       100     77

In [8]:
df.loc[:,"Ishita"]

Maths       47
Science    100
Hindi       98
Name: Ishita, dtype: int64

In [11]:
df["Ishita"]

Maths       47
Science    100
Hindi       98
Name: Ishita, dtype: int64

In [12]:
df.loc["Maths"]

Arnab        90
Riya        100
Ishita       47
Samridhi     97
Rohan        89
Name: Maths, dtype: int64

# B) Boolean Indexing

It is used when we want to imply some constraints like marks >90, so it return true false in the place of actual values

In [13]:
df.loc["Maths"]>90

Arnab       False
Riya         True
Ishita      False
Samridhi     True
Rohan       False
Name: Maths, dtype: bool

# C) Slicing

Data Frame Slicing is inclusive of the end values

In [14]:
df.loc["Maths":"Hindi"]

         Arnab  Riya  Ishita  Samridhi  Rohan
Maths       90   100      47        97     89
Science     91    95     100        52     82
Hindi       97    78      98       100     77

In [15]:
df.loc["Maths":"Science"]

         Arnab  Riya  Ishita  Samridhi  Rohan
Maths       90   100      47        97     89
Science     91    95     100        52     82

In [19]:
df.loc["Maths":"Hindi","Arnab":"Ishita"]

         Arnab  Riya  Ishita
Maths       90   100      47
Science     91    95     100
Hindi       97    78      98

In [20]:
df.loc["Maths":"Science",["Arnab","Samridhi"]]

         Arnab  Samridhi
Maths       90        97
Science     91        52

# D) Filtering Rows in DataFrame
True and false can be associated with indices.

In [21]:
df.loc[[True,False,False]]

       Arnab  Riya  Ishita  Samridhi  Rohan
Maths     90   100      47        97     89

In [22]:
df.loc[[True,False,True]]

       Arnab  Riya  Ishita  Samridhi  Rohan
Maths     90   100      47        97     89
Hindi     97    78      98       100     77

In [23]:
df.loc[[True,True,True]]

         Arnab  Riya  Ishita  Samridhi  Rohan
Maths       90   100      47        97     89
Science     91    95     100        52     82
Hindi       97    78      98       100     77